In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('Used_Bikes.csv')
df.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [3]:
df.duplicated().sum()

25324

In [5]:
df.drop_duplicates(inplace=True)

In [6]:
df.shape

(7324, 8)

In [7]:
df.isnull().sum()

bike_name     0
price         0
city          0
kms_driven    0
owner         0
age           0
power         0
brand         0
dtype: int64

In [9]:
cat_col = df.select_dtypes(include="O")
cat_col

,bike_name,city,owner,brand
0,TVS Star City Plus Dual Tone 110cc,Ahmedabad,First Owner,TVS
1,Royal Enfield Classic 350cc,Delhi,First Owner,Royal Enfield
2,Triumph Daytona 675R,Delhi,First Owner,Triumph
3,TVS Apache RTR 180cc,Bangalore,First Owner,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,Bangalore,First Owner,Yamaha
...,...,...,...,...
9362,Hero Hunk Rear Disc 150cc,Delhi,First Owner,Hero
9369,Bajaj Avenger 220cc,Bangalore,First Owner,Bajaj
9370,Harley-Davidson Street 750 ABS,Jodhpur,First Owner,Harley-Davidson
9371,Bajaj Dominar 400 ABS,Hyderabad,First Owner,Bajaj
9372,Bajaj Avenger Street 220,Hyderabad,First Owner,Bajaj

In [10]:
num_col = df.select_dtypes(exclude="O")
num_col

         price  kms_driven  age  power
0      35000.0     17654.0  3.0  110.0
1     119900.0     11000.0  4.0  350.0
2     600000.0       110.0  8.0  675.0
3      65000.0     16329.0  4.0  180.0
4      80000.0     10000.0  3.0  150.0
...        ...         ...  ...    ...
9362   25000.0     48587.0  8.0  150.0
9369   35000.0     60000.0  9.0  220.0
9370  450000.0      3430.0  4.0  750.0
9371  139000.0     21300.0  4.0  400.0
9372   80000.0      7127.0  5.0  220.0

[7324 rows x 4 columns]

In [12]:
cat_col.drop(['bike_name','city'],axis='columns',inplace=True)

In [13]:
df['owner'].value_counts()

owner
First Owner             6642
Second Owner             588
Third Owner               84
Fourth Owner Or More      10
Name: count, dtype: int64

In [14]:
dt = {"First Owner":1,"Second Owner":2,
      "Third Owner":3,
     "Fourth Owner Or More":4}
dt

{'First Owner': 1,
 'Second Owner': 2,
 'Third Owner': 3,
 'Fourth Owner Or More': 4}

In [15]:
df['owner'] = df['owner'].map(dt)

In [20]:
brands = list(df['brand'].value_counts().keys())
brands

['Bajaj',
 'Royal Enfield',
 'Hero',
 'Honda',
 'Yamaha',
 'TVS',
 'KTM',
 'Suzuki',
 'Harley-Davidson',
 'Kawasaki',
 'Hyosung',
 'Mahindra',
 'Benelli',
 'Triumph',
 'Ducati',
 'BMW',
 'Jawa',
 'Indian',
 'MV',
 'Rajdoot',
 'LML',
 'Yezdi',
 'Ideal']

In [ ]:
{'Bajaj', 'Royal Enfield', 'Hero', 'Honda', 'Yamaha', 'TVS', 'KTM',
       'Suzuki', 'Harley-Davidson', 'Kawasaki', 'Hyosung', 'Mahindra',
       'Benelli', 'Triumph', 'Ducati', 'BMW', 'Jawa', 'Indian', 'MV',
       'Rajdoot', 'LML', 'Yezdi', 'Ideal'}

In [24]:
dt = {}
for i,item in enumerate(brands):
     # print(item," ",i)
    dt[item] = i
dt

{'Bajaj': 0,
 'Royal Enfield': 1,
 'Hero': 2,
 'Honda': 3,
 'Yamaha': 4,
 'TVS': 5,
 'KTM': 6,
 'Suzuki': 7,
 'Harley-Davidson': 8,
 'Kawasaki': 9,
 'Hyosung': 10,
 'Mahindra': 11,
 'Benelli': 12,
 'Triumph': 13,
 'Ducati': 14,
 'BMW': 15,
 'Jawa': 16,
 'Indian': 17,
 'MV': 18,
 'Rajdoot': 19,
 'LML': 20,
 'Yezdi': 21,
 'Ideal': 22}

In [30]:
dt = {key:i for i,key in enumerate(brands)} # dictionary comprehension
dt

{'Bajaj': 0,
 'Royal Enfield': 1,
 'Hero': 2,
 'Honda': 3,
 'Yamaha': 4,
 'TVS': 5,
 'KTM': 6,
 'Suzuki': 7,
 'Harley-Davidson': 8,
 'Kawasaki': 9,
 'Hyosung': 10,
 'Mahindra': 11,
 'Benelli': 12,
 'Triumph': 13,
 'Ducati': 14,
 'BMW': 15,
 'Jawa': 16,
 'Indian': 17,
 'MV': 18,
 'Rajdoot': 19,
 'LML': 20,
 'Yezdi': 21,
 'Ideal': 22}

In [31]:
cat_col['brand'] = cat_col['brand'].map(dt)

In [33]:
df.drop(['bike_name','city'],axis='columns',inplace=True)

In [41]:
x = df.drop('price',axis='columns')
y = df[['price']]
# pip install scikit-learn

In [39]:
from sklearn.model_selection import train_test_split

In [42]:
x_train,x_test,y_train,y_test = train_test_split(x,y, test_size=0.2)

In [43]:
x_train

      kms_driven  owner   age  power  brand
8315     17500.0      1   6.0  200.0      0
6182     11000.0      1   4.0  100.0      2
5089      5000.0      1   4.0  350.0      1
8835     46000.0      1   6.0  160.0      3
486      45949.0      1   4.0  160.0      5
...          ...    ...   ...    ...    ...
1923     22000.0      1  10.0  150.0      3
8703     13416.0      1  17.0  150.0      3
3955     18516.0      1   3.0  150.0      0
8410     19500.0      1   5.0  180.0      5
1693     19000.0      1   3.0  150.0      4

[5859 rows x 5 columns]